// global
// ────────────────────────────────────────────────────────────

// Так было удобней
function promptInt(str) {
    return parseInt(prompt(str));
}

// 1
// ────────────────────────────────────────────────────────────

// const i = prompt('Как вас зовут?');

// console.log(`Привет, ${i}!`);

// 2
// ────────────────────────────────────────────────────────────

// const i = promptInt('Ваш год вашего рождения?'),
//     nowYear = new Date().getFullYear();

// console.log(`Ваш возрост: ${nowYear - i}`);

// 3
// ────────────────────────────────────────────────────────────

// const i = promptInt('Введите длину стороны квадрата чтобы узнать его периметр');

// console.log(`P= ${i * 4}`);

// 4
// ────────────────────────────────────────────────────────────

// const i = promptInt('Введите радиус окружности чтобы узналь её периметр');

// console.log(`P= ${Math.PI * i ** 2}`);

// 5
// ────────────────────────────────────────────────────────────

// const i = promptInt('Сколько километров между городами?'),
//     h = promptInt('За сколько часов вы хотите добратся?');

// console.log(`Двигайтель со скоростью - ${i / h}КМ/Ч`);

// 6
// ────────────────────────────────────────────────────────────

// const i = promptInt('Введите количество долларов');

// console.log(`У вас €${i * 0.86}`);

// 7
// ────────────────────────────────────────────────────────────

// const i = promptInt('Укажите размер флешки в ГБ'),
//     mb = i * 1024;

// console.log(`${parseInt(mb / 820)} файлов размером 820мб поместится на флешке.\nОстанется ${mb % 820}мб свободного места.`);

// 8
// ────────────────────────────────────────────────────────────

// const i = promptInt('Укажите суму денег'),
//     x = promptInt('Укажите цену шоколадки');

// console.log((i > x) ? `На суму ${i}, вы сможите купить ${parseInt(i / x)} шоколадок ценой ${x}.\nОстаток ${i%x}.` : `Иди работай!`);

// 9
// ────────────────────────────────────────────────────────────

// const i = promptInt('Введите число');

// console.log(`${parseInt((i / 1) % 10)}${parseInt((i / 10) % 10)}${parseInt((i / 100) % 10)}`);

// 10
// ────────────────────────────────────────────────────────────

// const i = promptInt('Введите число');

// console.log((i % 2 === 0) ? `Число ${i} является четным!` : `Число ${i} не четное!`);